import React, { Component } from 'react';
import { Text, View, StyleSheet, ScrollView, RefreshControl ,ListView, Picker, Image, TouchableOpacity } from 'react-native';
import LinearGradient from 'react-native-linear-gradient';

import Header from '../../common/Header';

const LANGUAGE = [
  {
    id: 1,
    label: '党的章程',
    value: 'java',
  },
  {
    id: 2,
    label: '党规党纪',
    value: 'js',
  },
  {
    id: 3,
    label: '党史精粹',
    value: 'python',
  },
  {
    id: 4,
    label: '人物长廊',
    value: 'node',
  },
  {
    id: 5,
    label: '党员发展标准',
    value: 'go',
  }
];

const LEARNING = {
  "java": [
    {
      title: "总纲",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    }
  ],
  "js": [
    {
      title: "权利保障条例",
      content: [
        {
          subTitle: "第一章 总则",
          subContent: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
        },
        {
          subTitle: "第一章 总则",
          subContent: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
        },
        {
          subTitle: "第一章 总则",
          subContent: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
        },
        {
          subTitle: "第一章 总则",
          subContent: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
        },
      ]
    },
    {
      title: "权利保障条例",
      content: [
        {
          subTitle: "第一章 总则",
          subContent: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
        },
        {
          subTitle: "第一章 总则",
          subContent: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
        },
        {
          subTitle: "第一章 总则",
          subContent: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
        },
        {
          subTitle: "第一章 总则",
          subContent: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
        },
      ]
    },
    {
      title: "权利保障条例",
      content: [
        {
          subTitle: "第一章 总则",
          subContent: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
        },
        {
          subTitle: "第一章 总则",
          subContent: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
        },
        {
          subTitle: "第一章 总则",
          subContent: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
        },
        {
          subTitle: "第一章 总则",
          subContent: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
        },
      ]
    },
  ],
  "python": [
    {
      title: "总纲",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "总纲",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "总纲",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "总纲",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
  ],
  "node": [
    {
      name: "邓小平",
      title: "邓小平",
      avatar: require('../img/person1.png'),
      time: "1893年12月26日－1976年9月9日",
      pic: require('../img/pic.png'),
      content: "毛泽东（1893年12月26日－1976年9月9日），字润之（原作咏芝，后改润芝），笔名子任。湖南湘潭人。中国人民的领袖，马克思主义者，伟大的无产阶级革命家、战略家和理论家，中国共产党、中国人民解放军和中华人民共和国的主要缔造者和领导人，诗人，书法家。[1]  1949至1976年，毛泽东担任中华人民共和国最高领导人。他对马克思列宁主义的发展、军事理论的贡献以及对共产党的理论贡献被称为毛泽东思想。因毛泽东担任过的主要职务几乎全部称为主席，所以也被人们尊称为“毛主席”。毛泽东被视为现代世界历史中最重要的人物之一，《时代》杂志也将他评为20世纪最具影响100人之一。毛泽东（1893年12月26日－1976年9月9日），字润之（原作咏芝，后改润芝），笔名子任。湖南湘潭人。中国人民的领袖，马克思主义者，伟大的无产阶级革命家、战略家和理论家，中国共产党、中国人民解放军和中华人民共和国的主要缔造者和领导人，诗人，书法家。[1]  1949至1976年，毛泽东担任中华人民共和国最高领导人。他对马克思列宁主义的发展、军事理论的贡献以及对共产党的理论贡献被称为毛泽东思想。因毛泽东担任过的主要职务几乎全部称为主席，所以也被人们尊称为“毛主席”。毛泽东被视为现代世界历史中最重要的人物之一，《时代》杂志也将他评为20世纪最具影响100人之一。"
    },
    {
      name: "邓小平",
      title: "邓小平",
      avatar: require('../img/person1.png'),
      time: "1893年12月26日－1976年9月9日",
      pic: require('../img/pic.png'),
      content: "毛泽东（1893年12月26日－1976年9月9日），字润之（原作咏芝，后改润芝），笔名子任。湖南湘潭人。中国人民的领袖，马克思主义者，伟大的无产阶级革命家、战略家和理论家，中国共产党、中国人民解放军和中华人民共和国的主要缔造者和领导人，诗人，书法家。[1]  1949至1976年，毛泽东担任中华人民共和国最高领导人。他对马克思列宁主义的发展、军事理论的贡献以及对共产党的理论贡献被称为毛泽东思想。因毛泽东担任过的主要职务几乎全部称为主席，所以也被人们尊称为“毛主席”。毛泽东被视为现代世界历史中最重要的人物之一，《时代》杂志也将他评为20世纪最具影响100人之一。"
    },
    {
      name: "邓小平",
      title: "邓小平",
      avatar: require('../img/person1.png'),
      time: "1893年12月26日－1976年9月9日",
      pic: require('../img/pic.png'),
      content: "毛泽东（1893年12月26日－1976年9月9日），字润之（原作咏芝，后改润芝），笔名子任。湖南湘潭人。中国人民的领袖，马克思主义者，伟大的无产阶级革命家、战略家和理论家，中国共产党、中国人民解放军和中华人民共和国的主要缔造者和领导人，诗人，书法家。[1]  1949至1976年，毛泽东担任中华人民共和国最高领导人。他对马克思列宁主义的发展、军事理论的贡献以及对共产党的理论贡献被称为毛泽东思想。因毛泽东担任过的主要职务几乎全部称为主席，所以也被人们尊称为“毛主席”。毛泽东被视为现代世界历史中最重要的人物之一，《时代》杂志也将他评为20世纪最具影响100人之一。"
    },
    {
      name: "邓小平",
      title: "邓小平",
      avatar: require('../img/person1.png'),
      time: "1893年12月26日－1976年9月9日",
      pic: require('../img/pic.png'),
      content: "毛泽东（1893年12月26日－1976年9月9日），字润之（原作咏芝，后改润芝），笔名子任。湖南湘潭人。中国人民的领袖，马克思主义者，伟大的无产阶级革命家、战略家和理论家，中国共产党、中国人民解放军和中华人民共和国的主要缔造者和领导人，诗人，书法家。[1]  1949至1976年，毛泽东担任中华人民共和国最高领导人。他对马克思列宁主义的发展、军事理论的贡献以及对共产党的理论贡献被称为毛泽东思想。因毛泽东担任过的主要职务几乎全部称为主席，所以也被人们尊称为“毛主席”。毛泽东被视为现代世界历史中最重要的人物之一，《时代》杂志也将他评为20世纪最具影响100人之一。"
    },
    {
      name: "邓小平",
      title: "邓小平",
      avatar: require('../img/person1.png'),
      time: "1893年12月26日－1976年9月9日",
      pic: require('../img/pic.png'),
      content: "毛泽东（1893年12月26日－1976年9月9日），字润之（原作咏芝，后改润芝），笔名子任。湖南湘潭人。中国人民的领袖，马克思主义者，伟大的无产阶级革命家、战略家和理论家，中国共产党、中国人民解放军和中华人民共和国的主要缔造者和领导人，诗人，书法家。[1]  1949至1976年，毛泽东担任中华人民共和国最高领导人。他对马克思列宁主义的发展、军事理论的贡献以及对共产党的理论贡献被称为毛泽东思想。因毛泽东担任过的主要职务几乎全部称为主席，所以也被人们尊称为“毛主席”。毛泽东被视为现代世界历史中最重要的人物之一，《时代》杂志也将他评为20世纪最具影响100人之一。"
    },
  ],
  "go": [
    {
      title: "总纲",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    },
    {
      title: "第一章 党员",
      content: "中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。党的最高理想和最终目标是实现共产主义。"
    }
  ],
}

class TabTwoScreenOne extends Component {
  constructor(props) {
    super(props);

    const ds = new ListView.DataSource({
      rowHasChanged: (r1, r2) => r1 !== r2,
    });
    this.state = {
      activeId: 4,
      dataSource: ds.cloneWithRows(LEARNING[LANGUAGE[3].value]),
    };
  }

  renderRow(rowData) {
    return (
      <TouchableOpacity style={styles.touchBox} onPress={() => this.props.navigation.navigate('TabOneScreenTwo', { data: rowData })} key={rowData.id}>
        <View style={styles.rightListBox}>
          <Text style={styles.rightListText}>{rowData.title}</Text>
          <LinearGradient 
              colors={['rgba(255, 116, 116, 0)', 'rgba(255, 94, 94, 100)']}
              style={styles.gradient} 
              start={{x: 0.0, y: 0.0}} end={{x: 1.0, y: 0.0}}
          />
        </View>
      </TouchableOpacity>
    )
  }

  setActiveId(activeId) {
    this.setState({
      activeId,
      dataSource: this.state.dataSource.cloneWithRows(LEARNING[LANGUAGE[activeId - 1].value]),
    });
  }

  render() {
    const value = this.state.language;
    return (
      <View style={styles.container}>
        <View style={styles.listLeftBox}>
          <ScrollView style={styles.listViewLeft}>
            {
              LANGUAGE.map(rowData => (
                <TouchableOpacity onPress={() => this.setActiveId(rowData.id)} key={rowData.id}>
                  <View style={styles.textBox}>
                    { this.state.activeId === rowData.id && <LinearGradient colors={['#FF0467', '#FC7437']}  start={{x: 0.0, y: 0.0}} end={{x: 1.0, y: 1.0}} style={styles.activeBox} />}
                    <Text style={[styles.text, this.state.activeId === rowData.id && styles.activeText]}>{rowData.label}</Text>
                  </View>
                </TouchableOpacity>
              ))
            }
          </ScrollView>
        </View>
        <View style={styles.rightBox}>
          <ListView
            style={styles.listView}
            enableEmptySections
            onEndReachedThreshold={10}
            dataSource={this.state.dataSource}
            renderRow={(rowData) => this.renderRow(rowData)}
          />
        </View>
      </View>
    )
  }
}


TabTwoScreenOne.navigationOptions = ({ navigation }) => ({
  headerTitle: (
      <View style={styles.headerTitle}>
        <Header 
          headerText="在线学习"
          logoRight={require('../img/answer.png')}
          logoText="在线答题"
          navigation={navigation}
        />
      </View>
    ),
})

const styles = StyleSheet.create({
  headerTitle: {
    top: -10,
  },
  container: {
    flex: 1,
    backgroundColor: '#FFF',
    flexDirection: 'row'
  },
  textBox: {
    height: 31,
    flexDirection: 'row',
    alignItems: 'center',
    marginTop: 12,
  },
  text: {
    fontFamily: 'PingFangSC-Regular',
    fontSize: 18,
    color: 'rgba(0,0,0,0.80)',
    marginLeft: 16
  },
  activeText: {
    marginLeft: 6,
  },
  listViewLeft: {
    width: 137,
    paddingTop: 36,
  },
  listLeftBox: {
    flex: 1,
    width: 137,
    shadowOffset: { x: 0, y: 2 },
    shadowRadius: 30,
    shadowColor: '#000',
    shadowOpacity: 0.2,
  },
  activeBox: {
    width: 10,
    height: 31,
  },
  touchBox: {
    flex: 1,
    height: 40,
    paddingLeft: 25,
  },
  gradient: {
    width: 230,
    height: 1,
    marginTop: 7
  },
  listView: {
    paddingTop: 36,
    width: 230,
  },
  rightListText: {
    fontFamily: 'PingFangSC-Regular',
    fontSize: 18,
    color: 'rgba(0,0,0,0.80)',
    backgroundColor: 'transparent',
    marginTop: 7,
  },
  rightListBox: {
    height: 40,
  }
})

export default TabTwoScreenOne;